# Напишите программу, в которой пользователь будет задавать две строки,
# а программа - определять количество вхождений одной строки в другой.
import string
string1 = input('Введите строку 1: ')
string2 = input('Введите строку 2: ')
print(string2.count(string2))